/*
	按位运算符：
		按位与运算符：&
		1&1 -> 1
		1&0 -> 0
		0&1 -> 0
		0&0 -> 0
*/

public class OperatorTest08{
	public static void main(String[] args){
		// 00100011
		int a = 35;
		// 00011010
		int b = 26;
		/*
			00100011
		&   00011010
		-------------------
		    00000010
		*/
		System.out.println(a & b); // 2

		/*
			怎么判断一个数字是否为奇数？
				第一种方式：对2取模，结果不等于0，表示奇数。
				第二种方式：让这个数字和1进行按位与操作，结果是1，表示是奇数。
		*/
		int num = 35;

		if(num % 2 != 0){
			System.out.println(num + "是奇数");
		}

		/*
			00100011
		  & 00000001
		  -------------
		    00000001
		*/
		if((num & 1) == 1){ // 注意运算符优先级问题。
			System.out.println(num + "是奇数");
		}


	}
}